Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: མཽད་གལ་གྱི་བུ་ངས་རིམ་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་དགེ་བའི་རྩ་བ་རྒྱ་ཆེ་བ་མངོན་པར་འདུས་བྱས་ཏེ། དེ་བཞིན་དུ་སྦྱར་རོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created vast roots of virtue in order to understand the path that leads to cessation as related to knowledge of the levels. I did this by wondering how I could fully awaken to unsurpassed and perfect buddhahood and then teach sentient beings about the knowledge of the path that leads to cessation as related to knowledge of the levels.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ནས་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་རྒྱལ་པོ་རོ་མྱང་བ་དང་ཉེས་དམིགས་ལ་མཁས་པ་ཞེས་བྱ་བ་ཞིག་བྱུང་ངོ་། །
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a king known as Expert on Experience and Shortcomings.

source: དེ་ཆོས་ཐམས་ཅད་ཀྱི་རོ་མྱང་བ་དང་ཉེས་དམིགས་ནི་རབ་ཏུ་ཤེས་ན་ངེས་པར་འབྱུང་བ་དེ་དག་རབ་ཏུ་མི་ཤེས་སོ། །
en: This king did not know how deliverance is achieved by understanding the experiences and shortcomings related to all phenomena.

source: ཆོས་འདི་དག་ལ་ངེས་པར་འབྱུང་བ་རབ་ཏུ་ཤེས་པ་སུ་ཞིག་ཡོད་སྙམ་ནས།
en: ‘Who may possess the knowledge of deliverance in relation to all these phenomena?’

source: དེའི་མཚན་མོ་ཉལ་དུ་སོང་བ་དང་། སངས་རྒྱས་ཀྱི་སྐུ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དག་དང་ལྡན་པ་བྱུང་ནས་དེས་དེ་ལ་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཁྱོད་སྐྱེ་བོ་མང་པོ་ལ་ཕན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་། འཇིག་རྟེན་ལ་སྙིང་བརྩེ་བའི་ཕྱིར་ཚུལ་བཞིན་དུ་སེམས་བསྐྱེད་པ་དེ་ལེགས་སོ་ལེགས་སོ། །
en: That night while the king was sleeping a buddha appeared before him, endowed with the thirty-two marks of a great being, and said, ‘Your Majesty, you wish to benefit many beings and bring them happiness, and so, out of love for the world, you have correctly engendered the mind of awakening. That is excellent, excellent indeed.

source: རྒྱལ་པོ་ཆེན་པོ་དེའི་ཕྱིར་ཁྱོད་ཉིད་ཀྱིས་ཤེས་པར་གྱིས་ཤིག །
en: Thus, Your Majesty, understand this:

source: མངོན་པར་འདུ་བྱེད་པ་མེད་པ་ནི་ངེས་པར་འབྱུང་བ་ཡིན་ཏེ།
en: Absence of karmic formation is deliverance.

source: གང་མངོན་པར་འདུ་མི་བྱེད་པ་དེ་མི་འབྱུང་ངོ་། །
en: When nothing is formed nothing occurs.

source: གང་མ་བྱུང་ན་དེ་ངེས་པར་འབྱུང་བ་ཞེས་བྱའོ། །
en: Where nothing occurs there is deliverance.’

source: དེ་སྟན་ལས་ལངས་ནས་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ནས་སངས་རྒྱས་ཀྱི་སྐུ་དེ་ལ་ཚིགས་སུ་བཅད་དེ་གསོལ་བ།
en: The king rose from his bed, draped his shawl over one shoulder, placed his right knee on the ground, and then spoke this verse to the buddha-form before him:

source: མི་མཆོག་འཇིག་རྟེན་མགོན་པོ་སྟེ། །བལྟ་ན་སྡུག་ཅིང་ཤིན་ཏུ་གསལ། །
en: “ ‘Supreme among humans, protector of the world, I behold your beauty and brilliance.

source: གང་དུ་སྐྱེ་བོ་རྨོངས་པ་དག །འདི་ནི་བྱང་ཆུབ་ལམ་ལགས་སོ། །
en: Where beings remain ignorant Lies the path of awakening.’

source: མཽད་གལ་གྱི་བུ་ཁྱོད་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་རོ་མྱང་བ་དང་ཉེས་དམིགས་ལ་མཁས་པ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན། ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Maudgalyāyana, in case you may think that at that time King Expert on Experience and Shortcomings was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་རོ་མྱང་བ་དང་ཉེས་དམིགས་ལ་མཁས་པ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was King Expert on Experience and Shortcomings.

source: དེའི་ཚེ་ངས་མངོན་པར་འདུ་མ་བྱས་ཤིང་ངེས་པར་འབྱུང་བ་བསྟན་ཏོ། །
en: At that time I taught the way of absence of karmic formation and deliverance.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་མངོན་པར་འདུ་མི་བྱེད་པ་ལ་མཁས་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas must become expert regarding the absence of karmic formation.

source: མངོན་པར་འདུ་མི་བྱེད་པ་ལ་མཁས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཆོས་རྣམས་ལ་མྱུར་དུ་ཕྱིར་མི་ལྡོག་པར་རབ་ཏུ་གནས་པར་འགྱུར་རོ། །
en: The bodhisattva who is an expert regarding the absence of karmic formation will quickly reach the irreversible stage with regard to all phenomena.”

source: མཽད་གལ་གྱི་བུ་ངས་སྔོན་གྱི་མཐའ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། དགེ་བའི་རྩ་བ་རྣམ་པ་སྣ་ཚོགས་དུ་མ་དག་མངོན་པར་འདུས་བྱས་ཏེ། ཇི་ལྟར་སྔར་བསྟན་པ་བཞིན་དུ་རྒྱ་ཆེར་བྱའོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created numerous different roots of virtue in order to understand the past. I did this by wondering how I could fully awaken to unsurpassed and perfect buddhahood and then teach sentient beings about knowledge of the past.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་ཅིང་གྲངས་མེད། བསམ་གྱིས་མི་ཁྱབ་གཞལ་གྱིས་མི་ལང་། དཔག་ཏུ་མེད་བརྗོད་དུ་མེད་པ་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་རྒྱལ་པོ་སྔོན་གྱི་མཐའ་ཤེས་པ་ཡོངས་སུ་རྟོགས་པ་ཞེས་བྱ་བ་ཞིག་བྱུང་ངོ་། །
en: “Long ago in the limitless, countless, inconceivable, immeasurable, boundless, and inexpressible cycle of existence, Maudgalyāyana, long before even the distant past there was a king named Knower of the Past.

source: དེ་བྱེད་པ་གང་དང་གང་རྩོམ་པ་དེ་སྔོན་གྱི་མཐའ་སོ་སོར་བརྟགས་ནས་རྩོམ་མོ། །
en: Whatever course of action this king would pursue, he always did so having examined the past.

source: གང་བདག་གི་ངོ་བོ་ཉིད་དབང་པོའི་བྱེ་བྲག་དེ་དག་ཐམས་ཅད་ནི་སྔོན་གྱི་ལས་ཀྱིས་བསྒྲུབས་པ་ཡིན་ཏེ།
en: The specific faculties that make up the nature of a person are all produced by previous karmic action.

source: ལ་ལ་ནི་གཟུགས་ངན། ལ་ལ་ནི་གཟུགས་བཟང་།
en: Thus, certain acts create an inferior body while others produce an excellent form.

source: ལ་ལ་ནི་བསོད་ནམས་དང་ལྡན། ལ་ལ་ནི་བསོད་ནམས་ཆུང་།
en: Some acts are meritorious, while others carry little merit.

source: ལ་ལ་ནི་བླུན། ལ་ལ་ནི་མཁས།
en: Some will make one dull while others make one intelligent.

source: ལ་ལ་ནི་བྲན། ལ་ལ་ནི་ཇོ་བོ།
en: Some will make one a servant while others make one a lord.

source: ལ་ལ་ནི་རབ་ཏུ་དགའ་བ་སྐྱེད། ལ་ལ་ནི་གཏི་མུག་སྐྱེད་དེ།
en: Some bring great joy, and some will make one close-minded.

source: གང་བདག་བྲན་དུ་འགྱུར་བའི་ལས་མངོན་པར་འདུ་བྱེད་པ་འདི་བདག་དང་འཐུན་པར་མི་འགྱུར་རོ། །
en: Karmic formation that makes one a servant is not agreeable to oneself.

source: གཟུགས་ངན་པར་འགྱུར་བའམ། བསོད་ནམས་ཆུང་བར་འགྱུར་བ་ནས། གཏི་མུག་སྐྱེད་པར་འགྱུར་བའི་ལས་མངོན་པར་འདུ་བྱེད་པ་འདི་ནི་བདག་དང་འཐུན་པར་མི་འགྱུར་རོ། །
en: Karmic formation that brings an inferior body, little merit, or close-mindedness is not agreeable to oneself.

source: གང་བདག་གཟུགས་བཟང་པོར་འགྱུར་བའི་ལས་མངོན་པར་འདུ་བྱེད་པ་དང་། དབང་པོ་ཐམས་ཅད་མ་ཚང་བ་མེད་པར་འགྱུར་བའི་ལས་མངོན་པར་འདུ་བྱེད་པ་དེ་དག་བདག་དང་འཐུན་པར་འགྱུར་རོ། །
en: Karmic formation that results in an excellent body, or the completeness of all faculties, is agreeable to oneself.

source: གང་བདག་ཡིད་ལ་གཅགས་པ་མེད་པར་འགྱུར་བའི་ལས་མངོན་པར་འདུ་བྱེད་པ་དེ་ཡིད་ལ་གཅགས་པ་མེད་པར་འགྱུར་བའི་ལས་མངོན་པར་འདུས་བྱས་ཏེ།
en: Karmic formation that makes the mind unattached is an activity of detachment.

source: དེ་བསྐལ་པ་གྲངས་མེད་པར་ནམས་ཀྱང་ཀུན་ནས་དཀྲིས་པའི་སེམས་མི་སྐྱེད་དོ། །
en: Such an activity will never yield mental bondage, not even after innumerable eons.

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་སྔོན་གྱི་མཐའ་ཤེས་པ་ཡོངས་སུ་རྟོག་པ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ
en: “Maudgalyāyana, in case you may think that at that time King Knower of the Past was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་སྔོན་གྱི་མཐའ་ཤེས་པ་ཡོངས་སུ་རྟོག་པ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was King Knower of the Past.

source: ང་སྔོན་གྱི་མཐའ་དེ་ཡོངས་སུ་རྟོག་པ་ན་ཉོན་མོངས་པའི་ཀུན་ནས་དཀྲིས་པའམ། ཉེས་པར་སྤྱད་པའི་ཀུན་ནས་དཀྲིས་པའི་སེམས་སྔོན་མ་བྱུང་ངོ་། །
en: With my understanding of the past, I did not produce any mental bondage of affliction or of shortcomings.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་སྔོན་གྱི་མཐའ་ཡོངས་སུ་བརྟག་པའི་ལས་མངོན་པར་འདུ་བྱ་ཞིང་དགེ་བ་ལ་བསྟེན་པར་བྱ། སྡིག་པ་སྤང་བར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas must engage in the karmic formation of examining the past, and so pursue what is virtuous while refraining from negative acts.

source: མཽད་གལ་གྱི་བུ་སྔོན་གྱི་མཐའ་སོ་སོར་རྟོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཀུན་ནས་དཀྲིས་པའི་སེམས་དང་བྲལ་ཞིང་། མྱུར་དུ་ཕྱིར་མི་ལྡོག་པ་ཉིད་ལ་རབ་ཏུ་གནས་པར་འགྱུར་རོ། །
en: Maudgalyāyana, a bodhisattva who examines the past will be free from mental bondage and quickly reach the irreversible stage.

source: མཽད་གལ་གྱི་བུ་ངས་སྔོན་གྱི་མཐའ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡོངས་སུ་ཤེས་པར་བྱ་བའི་དོན་ནས། མངོན་པར་འདུས་བྱས་པའི་བར་སྔ་མ་བཞིན་ནོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created numerous different roots of virtue in order to understand the origin as related to knowledge of the past. I did this by wondering how I could fully awaken to unsurpassed and perfect buddhahood and then teach sentient beings about knowledge of the origin as related to knowledge of the past.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། རྒྱལ་པོ་སྔོན་གྱི་མཐའ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡོངས་སུ་རྟོག་པ་ཞེས་བྱ་བ་
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a king by the name of Knower of the Origin as Related to Knowledge of the Past.

source: སྡིག་པ་ཐམས་ཅད་དང་བྲལ་ཞིང་། དགེ་བའི་ཆོས་ཐམས་ཅད་ལ་མངོན་པར་དགའ་བ་ཞིག་བྱུང་ངོ་། །
en: He was free from all negativity and took great joy in the qualities of virtue.

source: དེ་ཚེ་ཐུང་བ་དག་ལ་སྨོད་ཅིང་། ཚེ་རིང་པོ་དག་ལ་མངོན་པར་དགའ།
en: He reviled short lifespans and delighted in longevity,

source: གནོད་པ་མང་པོ་དག་ལ་སྨོད་ཅིང་། གནོད་པ་ཉུང་བ་དག་ལ་མངོན་པར་དགའ།
en: reviled the harmful and delighted in what is of little harm,

source: རིགས་དམའ་བ་དག་ལ་སྨོད་ཅིང་། རིགས་མཐོན་པོ་དག་ལ་མངོན་པར་དགའ།
en: reviled low class and delighted in high class,

source: གཟི་བརྗིད་ཆུང་བ་དག་ལ་སྨོད་ཅིང་། གཟི་བརྗིད་ཆེན་པོ་དག་ལ་མངོན་པར་དགའ།
en: reviled the lackluster and delighted in the splendid,

source: དབུལ་བ་དག་ལ་སྨོད་ཅིང་། ལོངས་སྤྱོད་ཆེན་པོ་དག་ལ་མངོན་པར་དགའ།
en: reviled poverty and delighted in wealth,

source: ཤེས་རབ་ཆུང་བ་དག་ལ་སྨོད་ཅིང་། ཤེས་རབ་ཆེན་པོ་དག་ལ་མངོན་པར་དགའ།
en: reviled poor understanding and delighted in great insight,

source: དབང་པོ་ཞན་པ་དག་ལ་སྨོད་ཅིང་། དབང་པོ་ཆེན་པོ་དག་ལ་མངོན་པར་དགའ།
en: reviled dull faculties and delighted in magnificent faculties,

source: ཚིག་མི་སྙན་པ་དག་ལ་སྨོད་ཅིང་། ཚིག་སྙན་པ་དག་ལ་མངོན་པར་དགའ།
en: reviled unpleasant words and delighted in beautiful words,

source: ཡང་དག་པ་མ་ཡིན་པའི་ཚིག་དག་ལ་སྨོད་ཅིང་། ཡང་དག་པའི་ཚིག་དག་ལ་མངོན་པར་དགའ།
en: reviled falsity and delighted in truth,

source: ཕྲ་མ་དག་ལ་སྨོད་ཅིང་ཕྲ་མ་མེད་པ་དག་ལ་མངོན་པར་དགའ།
en: reviled divisive talk and delighted in harmonious words,

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། ཚིག་རྩུབ་པོ་དང་། ཚིག་རྩུབ་པོ་མ་ཡིན་པ་དང་། སྡུམས་བྱེད་པ་དང་། སྡུམས་མི་བྱེད་པ་དང་། བརྣབ་སེམས་དང་། བརྣབ་སེམས་མེད་པ་དང་། གནོད་སེམས་དང་། གནོད་སེམས་མེད་པ་དང་། ལོག་པར་ལྟ་བ་ལ་ནི་སྨོད། ཡང་དག་པར་ལྟ་བ་ལ་ནི་མངོན་པར་བརྩོན་ཏེ
en: reviled harsh words and delighted in gentle words, reviled antagonism and delighted in reconciliation, reviled covetousness and delighted in contentment, reviled ill will and delighted in kindness, and reviled wrong view and delighted in right view.

source: དེ་སྡིག་པ་ནི་སྤོང་། དགེ་བ་ལ་ནི་མངོན་པར་དགའ་ཞིང་། སྐྱེ་བོ་དེ་དག་ཐམས་ཅད་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་རབ་ཏུ་བཀོད་དོ། །
en: Thus he refrained from negative acts, took joy in virtue, and established all the people on the path of the ten virtuous acts.

source: བྱམས་པའི་སེམས་སྔོན་དུ་བཏང་བས་དེ་དག་ལ་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡང་དག་པར་རབ་ཏུ་བསྟན་ཏེ།
en: With love he taught them the ten avenues of virtuous action.

source: དེ་འཇིག་རྟེན་འཇིག་པ་ན་འོད་གསལ་གྱི་ལྷ་རྣམས་ཀྱི་ནང་དུ་སྐྱེས། འཇིག་རྟེན་ཆགས་པ་ན་ཚངས་པའི་གཞལ་མེད་ཁང་སྟོང་པར་སྐྱེས་སོ། །
en: Thus, when the world was destroyed they all took birth among the gods of luminosity, and when a new world formed they were born in a thousand Brahmā palaces.

source: མཽད་གལ་གྱི་བུ་ཁྱོད་དེའི་ཚེ་དེའི་དུས་ན། རྒྱལ་པོ་སྔོན་གྱི་མཐའ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡོངས་སུ་རྟོག་པ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Maudgalyāyana, in case you may think that at that time King Knower of the Origin as Related to Knowledge of the Past was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་སྔོན་གྱི་མཐའ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡོངས་སུ་རྟོག་པ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was that king, Knower of the Origin as Related to Knowledge of the Past.

source: ང་བྱམས་པའི་སེམས་སྔོན་དུ་བཏང་ནས་སེམས་ཅན་དེ་དག་ལ་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་བསྟན་པས་ཚངས་པའི་འཇིག་རྟེན་དུ་སྐྱེས་སོ། །
en: With loving concern I taught those beings the path of the ten virtuous acts, whereby they were born in the realm of Brahmā.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན། བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པའི་སེམས་ཀྱིས་ཏིང་ངེ་འཛིན་ལ་རབ་ཏུ་གནས་པར་བྱ།
en: Therefore, Maudgalyāyana, bodhisattvas must abide in absorption by means of a loving heart.

source: མི་གནས་པའི་ཚུལ་གྱིས་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་བསྒོམ་པར་བྱའོ། །
en: By way of non-abiding, they must cultivate the path of the ten virtuous acts.

source: མཽད་གལ་གྱི་བུ་ངས་སྔོན་གྱི་མཐའ་ཤེས་པ་འགོག་པ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ནས། མངོན་པར་འདུས་བྱས་པའི་བར་དང་། ཡང་དག་པར་རབ་ཏུ་བསྟན་པའི་བར་དུའོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created numerous different roots of virtue in order to understand cessation as related to knowledge of the past. I did this by wondering how I could fully awaken to unsurpassed and perfect buddhahood and then teach sentient beings about the knowledge of cessation as related to knowledge of the past.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་དྲང་སྲོང་བློ་གྲོས་གཙང་མ་ཞེས་བྱ་བ་ཞིག་བྱུང་ངོ་། །
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a sage known as Pure Intelligence.

source: དེ་ཉོན་མོངས་པ་གང་དང་གང་ཉིད་སྐྱེས་པ་དེ་དང་དེ་ཉིད་ལ་མི་གཙང་བའི་འདུ་ཤེས་སུ་གྱུར་ཏོ། །
en: Whenever an affliction arose, this sage would perceive it as unclean.

source: དེ་མི་གཙང་བར་སེམས་པ་ན་མྱུར་བ་ཉིད་དུ་སྤོང་བར་བྱེད། སེལ་བར་བྱེད། འདོར་བར་བྱེད་དེ་དེས་མངོན་པར་མི་དགའོ། །
en: Thus, thinking the afflictions unclean, he very quickly renounced, dispelled, and relinquished them without harboring any fondness for them.

source: དེ་ཡུན་མི་རིང་བར་ཉོན་མོངས་པ་ཐམས་ཅད་ལ་ཤིན་ཏུ་མི་སྤྱོད་པར་འགྱུར་ཏེ། དག་པ་རྣམ་པར་བྱང་བའི་ཕྱོགས་ཉིད་ལ་གནས་པར་གྱུར་ཏོ། །
en: In this way he soon avoided engaging in any of the afflictions, abiding instead by the factors that bring about their purification.

source: ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དེ་དག་ཐམས་ཅད་དེ་ལ་གཞོལ་བར་གྱུར་ཏེ། དེ་ལ་འབབ་དེ་ལ་བབ་སྟེ། ཐ་ན་རྩྭའི་ལྷ་ཡང་དེ་ལ་གཞོལ་བར་གྱུར་དེ་ལ་འབབ་དེ་ལ་བབ་བོ། །
en: All the gods, nāgas, yakṣas, and gandharvas then began to take up, abide by, and follow the same practice, and so even the most insignificant gods would abide by and follow such practice.

source: དེར་སྐྱེ་བོ་ཐམས་ཅད་ལས་བདག་གིར་བྱ་བའི་ཤེས་པ་ལ་བཙུད་དེ།
en: “As for human beings, the sage would introduce them to the knowledge of how karmic action is appropriated.

source: ཇི་ལྟར་ལས་བྱས་པ་དག་གི་རྣམ་པར་སྨིན་པ་འགྲུབ་པ་འདིར་སྐྱེ་བོ་ཐམས་ཅད་ལ་མངོན་སུམ་ཡིན་ན་མི་རིགས་པས་ཡོངས་སུ་བསྒྱུར་ནས་བདག་གི་ལས་ཀྱི་འབྲས་བུ་ཆུད་གཟོན་ཏོ། །
en: Since the ripening of beings’ past karmic actions is not perceptible to them, they might get the impression that the effects of their karmic actions can fade away by means of transformation.

source: དེས་སྐྱེ་བོ་དེ་དག་ལས་བདག་གིར་བྱ་བ་ཤེས་པ་ལ་བཙུད་ཅིང་། ལས་བདག་གིར་བྱ་བ་ཤེས་པ་ལ་རབ་ཏུ་བཀོད་དེ།
en: The sage therefore introduced everyone to the knowledge of how karmic action is appropriated and thus he established everyone within that knowledge.

source: ཤེས་པའི་གཉེན་པོ་སྐྱེས་ནས་ཕལ་ཆེར་ལུས་ཞིག་ནས་ཤིའོ། །
en: As this remedial knowledge had now arisen in them, as their lives came to an end and they died, [they were reborn in the realm of Brahmā.]

source: ཤི་ནས་ཚངས་པའི་འཇིག་རྟེན་དུ་སྐྱེས་པར་གྱུར་ཏོ། །
en: [As this remedial knowledge had now arisen in them,] as their lives came to an end and they died, they were reborn in the realm of Brahmā.

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན་དྲང་སྲོང་བློ་གྲོས་གཙང་མ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན། ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Maudgalyāyana, in case you may think that at that time the sage Pure Intelligence was anyone else, do not think so.

source: དེའི་ཚེ་དེའི་དུས་ན་ང་དྲང་སྲོང་བློ་གྲོས་གཙང་མ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was that sage, Pure Intelligence.

source: ངས་སྐྱེ་བོ་དེ་དག་ལས་བདག་གིར་བྱ་བ་ཤེས་པ་ལ་བཙུད་ཅིང་རབ་ཏུ་བཀོད་དེ།
en: I introduced those beings to the knowledge of how karmic action is appropriated and established them within that knowledge.

source: དེ་ཤེས་པའི་གཉེན་པོ་སྐྱེས་ནས་ཚངས་པའི་འཇིག་རྟེན་དུ་སྐྱེས་སོ། །
en: When the remedial knowledge had thus arisen, they were all reborn in the realm of Brahmā.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་ལས་བདག་གིར་བྱ་བར་ཤེས་པ་ལ་རབ་ཏུ་གནས་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas must abide by the knowledge of how karmic action is appropriated.

source: མཽད་གལ་གྱི་བུ་ངས་སྔོན་གྱི་མཐའ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་དགེ་བའི་རྩ་བ་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་པ་ནས། ཡང་དག་པར་རབ་ཏུ་བསྟན་པའི་བར་དུའོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created numerous different roots of virtue in order to understand the path that leads to cessation as related to knowledge of the past. I did this by wondering how I could fully awaken to unsurpassed and perfect buddhahood and then teach sentient beings about the knowledge of the path that leads to cessation as related to knowledge of the past.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་ཅིང་། གྲངས་མེད་པ་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་དྲང་སྲོང་ལམ་བྱིན་ཞེས་བྱ་བ་ཞིག་བྱུང་སྟེ
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a sage known as Path Giver,

source: སའི་མཐའ་རྒྱ་མཚོར་བཅས་པ་བཏང་ནས་རབ་ཏུ་བྱུང་ངོ་། །
en: who had become ordained after having relinquished the entire earth as well as the ocean.

source: དེ་ཚལ་གྱི་ནང་དུ་སོང་སྟེ། ཤིང་ལྗོན་པ་ལ་རྟོག་པ་ན་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: This sage had entered the forest, and there he thought about the trees:

source: ཤིང་ལྗོན་པ་འདི་ཡུན་མི་རིང་བར་ས་ལ་ལྟུང་བར་འགྱུར་རོ། །
en: ‘These trees will before long all fall.

source: བསགས་པ་ཐམས་ཅད་ཀྱི་མཐའ་ཟད་པ་ཡིན་ལ། མཐོ་བ་དག་ནི་ལྟུང་བ་ཡིན་ཏེ།
en: Because all accumulation ends in exhaustion, and the high stands to fall.

source: གང་མཐོ་བ་ལས་མི་ལྟུང་བའི་ཐབས་གང་ཞིག་ཡོད་སྙམ་མོ། །
en: Nothing whatsoever can prevent that which is high from falling.

source: གང་དག་མི་མཐོ་བ་དེ་མི་ལྟུང་ངོ་སྙམ་མོ། །
en: However, that which is not high, will not fall.

source: ང་རྒྱལ་གྱིས་མཐོ་བར་འགྱུར་ཏེ། ང་རྒྱལ་མེད་ན་མཐོ་བ་མེད་དོ་སྙམ་ནས།
en: Pride makes one rise high, but without pride there is no “high.” ’

source: དེ་ང་རྒྱལ་སྤང་བའི་ཕྱིར་ཆོས་སྟོན་ཏེ། ང་རྒྱལ་སྤང་བའི་ཕྱིར་ཆོས་བསྟན་ནས་སྙིང་རྗེ་དང་ལྡན་པའི་སེམས་ཀྱིས་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡང་དག་པར་རབ་ཏུ་བསྟན་ཏོ། །
en: “Hence, to relinquish pride the sage taught the Dharma, compassionately explaining the activities of the ten virtues to sentient beings.

source: དེ་སྙིང་རྗེ་དང་ལྡན་པའི་སེམས་ཀྱིས་སེམས་ཅན་དེ་དག་ལ་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡང་དག་པར་རབ་ཏུ་བསྟན་ནས། ལུས་ཞིག་སྟེ་ཤི་བའི་འོག་ཏུ་ཚངས་པའི་འཇིག་རྟེན་དུ་སྐྱེས་སོ། །
en: Thus, having taught beings compassionately, he was born in the realm of Brahmā upon the disintegration of his body.

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན་དྲང་སྲོང་ལམ་བྱིན་ཞེས་བྱ་བར་གྱུར་པ་གང་སྙིང་རྗེ་དང་ལྡན་པའི་སེམས་ཀྱིས་དེ་དག་ལ་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་ཡང་དག་པར་རབ་ཏུ་བསྟན་ནས་ཚངས་པའི་འཇིག་རྟེན་དུ་སྐྱེས་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེང་དེར་གྱུར་ཏོ། །
en: “Maudgalyāyana, in case you may think that at that time the sage Path Giver, who with compassion taught the Dharma of the activities of the ten virtues to sentient beings, was anyone else, do not, because I was him.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སྙིང་རྗེ་དང་ལྡན་པའི་སེམས་ཀྱིས་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱ་སྟེ།
en: Therefore, Maudgalyāyana, bodhisattvas must teach beings the activities of the ten virtues with a compassionate mind.

source: དེ་ཕྱིར་མི་ལྡོག་པ་ཉིད་ལ་གནས་པར་འགྱུར་རོ། །
en: Thereby they will reach the stage of irreversibility.”

source: མཽད་གལ་གྱི་བུ་ངས་གནས་ཤེས་པར་བྱ་བའི་དོན་དུ་འདས་པའི་དུས་ནས་དེ་བཞིན་དུ་སྦྱར་ཏེ།
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created numerous different roots of virtue in order to understand what is possible.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་དྲང་སྲོང་ཤིན་ཏུ་ཁྲིད་བྱེད་ཅེས་བྱ་བ་ཕྱི་རོལ་གྱི་ལམ་གྱིས་འདོད་པ་དག་གི་འདོད་ཆགས་དང་བྲལ་བ་ལྔ་མངོན་པར་ཤེས་པ་ཞིག་བྱུང་ངོ་། །
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a sage known as Thorough Guide, who by means of a non-Buddhist path had reached freedom from the passions of desire and accomplished the five superknowledges.

source: གང་གིས་སེམས་ཅན་འདི་དག་གི་སྐྱེ་བ་ཡང་ཐ་དད་པ་ཉིད་དུ་སྣང་། རིགས་ཀྱང་ཐ་དད་པ་ཉིད་དུ་སྣང་།
en: ‘These beings all appear to be of different births, classes, and families.

source: རུས་ཀྱང་ཐ་དད་པ་ཉིད་དུ་སྣང་བའི་རྒྱུ་ནི་གང་རྐྱེན་ནི་གང་ཡིན་སྙམ་མོ། །
en: What might be the causes and the conditions for this?

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ། ཉོན་མོངས་པ་རབ་ཏུ་སྤྱོད་པ་ལས་གཞན་མ་ཡིན་ཏེ།
en: The causes and conditions cannot be anything other than involvement in afflictions.

source: ཇི་ལྟ་བུའི་ཉོན་མོངས་པ་རབ་ཏུ་སྤྱོད་ན། དེ་ལྟ་བུའི་ལས་མངོན་པར་འདུ་བྱེད་དོ། །
en: When one is involved in afflictions one will form corresponding karmic activities,

source: ཇི་ལྟ་བུའི་ལས་མངོན་པར་འདུ་བྱེད་ན། དེ་ལྟ་བུའི་རྣམ་པར་སྨིན་པ་འགྲུབ་པར་འགྱུར་ཏེ།
en: and with the formation of such karmic activities there will be a corresponding form of ripening.

source: རྒྱུ་ལས་དང་ཉོན་མོངས་པ་ཡིན་ནོ། །
en: So the causes are karmic action and affliction.

source: ཉོན་མོངས་པ་དེ་གང་གི་ཡིན།
en: whose are the afflictions,

source: ལས་མངོན་པར་འདུ་བྱེད་པ་དེ་ཡང་གང་གི་ཡིན།
en: Yet whose is the formation of karmic action,

source: རྣམ་པར་སྨིན་པ་དེ་ཡང་སུ་ཞིག་གིས་མྱོང་བར་འགྱུར་རོ་སྙམ་མོ། །
en: and who will experience the ripening?’

source: ཚོགས་འདུས་པའི་དབང་གིས་ལས་མངོན་པར་འདུ་བྱེད་པ་ལས་གཞན་མ་ཡིན་ཏེ།
en: ‘The formation of karmic action is not due to anything other than an assembly of factors.

source: དེ་ལ་ཉོན་མོངས་པ་ནི་བདག་གིས་ལས་བསྐྱེད་པར་བྱའོ་སྙམ་དུ་མི་སེམས།
en: Thus, no affliction thinks, “I shall give rise to karmic action”;

source: ལས་ཀྱང་བདག་གིས་རྣམ་པར་སྨིན་པར་འགྲུབ་པར་བྱའོ་སྙམ་དུ་མི་སེམས།
en: no karmic action thinks, “I shall bring ripening”;

source: རྣམ་པར་སྨིན་པ་ཡང་བདག་གིས་གང་ཞིག་རྣམ་པར་སྨིན་པར་བྱའོ་སྙམ་དུ་མི་སེམས་མོད་ཀྱི།
en: and no ripening thinks, “I shall ripen on someone.”

source: འོན་ཀྱང་མེད་པའི་ཆོས་ལ་བདག་གོ་སྙམ་དུ་ཡོངས་སུ་བཟུང་ནས། སྡུག་བསྔལ་གྱི་ཚོགས་དང་སྦྲེལ་ཏོ། །
en: Rather, the thought of “I” is projected without any real basis, and this is what creates the link to the myriad types of suffering.

source: སྡུག་བསྔལ་དེ་གང་ནས་ཀྱང་མ་བྱུང་།
en: Suffering does not come from anywhere,

source: གང་གི་ཡང་མ་ཡིན་སུས་ཀྱང་མ་བསྐྱེད།
en: does not belong to anything, is not produced by anyone,

source: ཅུང་ཟད་ཀྱང་ཡོངས་སུ་བཟུང་བ་མེད་དོ། །
en: and is not apprehended, even in the slightest.

source: འདི་ལྟར་གང་ཞིག་བདག་གོ་སྙམ་པ་དེ་ནི་མེད་དེ་མེད་པ་ལ་མངོན་པར་ཞེན་ཏོ། །
en: Because the conceived “I” is not there but just thought to be there.

source: གང་བདག་མེད་པ་ལ་མངོན་པར་ཞེན་པ་དེ་བདག་ཉིད་ཆུད་གཟོན་ཏེ། བདག་མེད་པའི་ཆོས་དག་ལ་བདག་ཏུ་མངོན་པར་ཞེན་ཏོ། །
en: When one is attached to a self that does not exist, the self becomes vulnerable, because one is attached to a self that is not really there.

source: དེ་བདག་ཏུ་མངོན་པར་ཞེན་ནས་སྡུག་བསྔལ་ཞེས་རྟོག་པར་བྱེད། གཙང་བ་དང་རྟག་གོ་ཞེས་རྟོག་པར་བྱེད་དོ། །
en: With such attachment to self there will be thoughts of “suffering,” as well as of “purity” and “permanence.”
